{
  "displayName": "CIS - Ensure TCP SYN Cookies is enabled",
  "enabled": true,
  "id": "0146f6f9-040f-4c3d-9001-0f2bc165b6c1",
  "longDescription": "Description:\nWhen tcp_syncookies is set, the kernel will handle TCP SYN packets normally until the\nhalf-open connection queue is full, at which time, the SYN cookie functionality kicks in. SYN\ncookies work by not using the SYN queue at all. Instead, the kernel simply replies to the\nSYN with a SYN|ACK, but will include a specially crafted TCP sequence number that\nencodes the source and destination IP address and port number and the time the packet\nwas sent. A legitimate connection would send the ACK packet of the three way handshake\nwith the specially crafted sequence number. This allows the system to verify that it has\nreceived a valid response to a SYN cookie and allow the connection, even though there is no\ncorresponding SYN in the queue.\nRationale:\nAttackers use SYN flood attacks to perform a denial of service attacked on a system by\nsending many SYN packets without completing the three way handshake. This will quickly\nuse up slots in the kernel's half-open connection queue and prevent legitimate connections\nfrom succeeding. SYN cookies allow the system to keep accepting valid connections, even if\nunder a denial of service attack.",
  "parameters": {
    "section": {
      "name": "sections",
      "sections": [
        {
          "section": {
            "name": "Technique parameters",
            "vars": [
              {
                "var": {
                  "name": "7E9A3AA5-A697-4F88-8D3D-A02E27E1B5F8",
                  "value": "net.ipv4.tcp_syncookies"
                }
              },
              {
                "var": {
                  "name": "F73D12E6-725A-4602-9299-48E33823EDCD",
                  "value": "1"
                }
              }
            ]
          }
        }
      ]
    }
  },
  "policyMode": "audit",
  "shortDescription": "",
  "tags": [
    {
      "cis-redhat7": "3"
    },
    {
      "cis-redhat7": "3.2"
    },
    {
      "cis-redhat7": "3.2.8"
    },
    {
      "cis-server": "1"
    },
    {
      "cis-workstation": "1"
    }
  ],
  "techniqueName": "Ensure_sysctl_key_value_IPV4",
  "techniqueVersion": "1.0"
}