{
  "displayName": "CIS - Ensure successful file system mounts are collected (32_bit)",
  "enabled": true,
  "id": "5e612120-06cc-4bc7-b903-786fc0df7010",
  "longDescription": "Description:\nMonitor the use of the mount system call. The mount (and umount ) system call controls the\nmounting and unmounting of file systems. The parameters below configure the system to\ncreate an audit record when the mount system call is used by a non-privileged user\nRationale:\nIt is highly unusual for a non privileged user to mount file systems to the system. While\ntracking mount commands gives the system administrator evidence that external media\nmay have been mounted (based on a review of the source of the mount and confirming it's\nan external media type), it does not conclusively indicate that data was exported to the\nmedia. System administrators who wish to determine if data were exported, would also\nhave to track successful open , creat and truncate system calls requiring write access to a\nfile under the mount point of the external media file system. This could give a fair\nindication that a write occurred. The only way to truly prove it, would be to track\nsuccessful writes to the external media. Tracking write system calls could quickly fill up the\naudit log and is not recommended. Recommendations on configuration options to track\ndata export to media is beyond the scope of this document.",
  "parameters": {
    "section": {
      "name": "sections",
      "sections": [
        {
          "section": {
            "name": "Technique parameters",
            "vars": [
              {
                "var": {
                  "name": "1CF9A017-7FD9-49B8-BDAA-0C22365FA988",
                  "value": "32_bit"
                }
              },
              {
                "var": {
                  "name": "7E9A3AA5-A697-4F88-8D3D-A02E27E1B5F8",
                  "value": "-a always,exit -F arch=b32 -S mount -F auid>=1000 -F auid!=4294967295 -k mounts"
                }
              },
              {
                "var": {
                  "name": "9E79F7F8-3CA6-4376-A510-11E00E134C91",
                  "value": "/etc/audit/audit.rules"
                }
              }
            ]
          }
        }
      ]
    }
  },
  "policyMode": "audit",
  "shortDescription": "",
  "tags": [
    {
      "cis-redhat7": "4"
    },
    {
      "cis-redhat7": "4.1"
    },
    {
      "cis-redhat7": "4.1.13"
    },
    {
      "cis-server": "2"
    },
    {
      "cis-workstation": "2"
    }
  ],
  "techniqueName": "Ensure_lines_present_in_file",
  "techniqueVersion": "1.0"
}