{
  "displayName": " CIS - Ensure SSH Idle Timeout Interval is configured (ClientAliveCountMax)",
  "enabled": true,
  "id": "56ebd9b5-082d-4570-bff6-eda8f8fdaa47",
  "longDescription": "Description: The two options ClientAliveInterval and ClientAliveCountMax control the timeout of ssh sessions. When the ClientAliveInterval variable is set, ssh sessions that have no activity for the specified length of time are terminated. When the ClientAliveCountMax variable is set, sshd will send client alive messages at every ClientAliveInterval interval. When the number of consecutive client alive messages are sent with no response from the client, the ssh session is terminated. For example, if the ClientAliveInterval is set to 15 seconds and the ClientAliveCountMax is set to 3, the client ssh session will be terminated after 45 seconds of idle time. Rationale: Having no timeout value associated with a connection could allow an unauthorized user access to another user's ssh session (e.g. user walks away from their computer and doesn't lock the screen). Setting a timeout value at least reduces the risk of this happening.. While the recommended setting is 300 seconds (5 minutes), set this timeout value based on site policy. The recommended setting for ClientAliveCountMax is 0. In this case, the client session will be terminated after 5 minutes of idle time and no keepalive messages will be sent.",
  "parameters": {
    "section": {
      "name": "sections",
      "sections": [
        {
          "section": {
            "name": "Technique parameters",
            "vars": [
              {
                "var": {
                  "name": "7E9A3AA5-A697-4F88-8D3D-A02E27E1B5F8",
                  "value": "ClientAliveCountMax"
                }
              },
              {
                "var": {
                  "name": "8E66BCAB-1D35-495A-92FD-7A30CB30F3F9",
                  "value": "${ncf_const.s}"
                }
              },
              {
                "var": {
                  "name": "9E79F7F8-3CA6-4376-A510-11E00E134C91",
                  "value": "0"
                }
              },
              {
                "var": {
                  "name": "F73D12E6-725A-4602-9299-48E33823EDCD",
                  "value": "/etc/ssh/sshd_config"
                }
              }
            ]
          }
        }
      ]
    }
  },
  "shortDescription": "",
  "techniqueName": "CIS_debian10___Ensure_key_value_in_file",
  "techniqueVersion": "1.0"
}